package Stage1_110225_040425.Lesson4;

public class Main { }

/*
1. Изучить API ArrayList, LikkedList, HashMap. Создать коллекции, добавить в начало, конец, середину элементы, удалить элемент, список элементов.
2. Написать свою реализацию коллекции на выбор LinkedList или ArrayList(можно оба варианта).
Должны быть основные методы add, get, remove, addAll(ДругаяКоллекция параметр), остальное на ваше усмотрение
Плюс написать реализацию сортировки пузырьком с флагом, который прекращает сортировку, если коллекция уже отсортирована.
3* На тему дженериков.
Для этих коллекций сделать конструктор который будет принимать другую коллекцию в качестве параметров и инициализироваться с элементами из этой коллекции.
Вторая часть - сделать метод сортировки статическим, этот метод также будет принимать какую-то коллекцию и сортировать ее. (Аналогия Collections.sort()).
Т.е подумать на тему какое ключевое слово(extends или super) будет лучше применить для этих двух задач.*/
