public class Main {
}

    /*Занятие 1
1. Какие языки программирования бывают.
2. JVM, JRE, JDK
3. Области памяти в java
4. Class Loaders. Виды, для чего нужны
5. Объект класса Class
6. Классы и объекты
6.1. Структура класса
6.1.1. Поля
6.1.2. Конструкторы(ключевое слово super и this)
6.1.3. Методы(сигнатура методов, перегрузка методов)
6.2. Статические и нестатические блоки инициализации
6.3. Модификаторы
6.3.1. static, final, abstract
6.3.2. private, protected, public, package private
6.4.
Варианты установки значений свойств объектов
6.4.1. Поля, конструктор, сеттеры(плюсы, минусы каждого)


    Занятие 2
1. Абстрактные классы и интерфейсы(отличия, где что лучше использовать)
2. Изменяемые и неизменяемые объекты(примеры неизменяемых
классов в java, как сделать класс неизменяемым)
3. Inner и Nested классы
4. Локальные и анонимные классы

    Занятие 3
1. Класс Object
1.1. Методы класса Object
1.2. Контракт equals - hashcode
1.3. Метод clone
2. Принципы ООП
2.1. Наследование и Ассоциация (определение, плюсы-минусы каждого)
2.2. Переопределение методов
2.3. Статическое и динамическое связывание
3. Оболочки примитивных типов. Основное API. Особенности сравнения значений.
4. String
4.1. String pool
4.2. API
4.3. StringBuilder, StringBuffer

    Занятие 4
1. Алгоритмы
1.1. Big O notation(какие виды временной сложности алгоритмов бывают)
1.2. Виды сортировок(отличие quicksort o merge sort)
3. Generics
4. Коллекции
3.1. Иерархия коллекций
3.1.1. List
3.1.2. Set
3.1.3. Map
3.2. Временная сложность для разных операций разных коллекций
3.3. Неизменяемые коллекции(создание помощью List.of(), методы класса Collections)
3.4. LinkedHashMap, TreeMap
3.5. Интерфейсы Comparable и Comparator

    Занятие 5
1.Лямбда выражения, функциональные интерфейсы, Stream API

    Занятие 6
1. Исключения
1.1. Иерархия исключений
1.2. Способы обработки исключений
1.3. try с ресурсами
2. Ввод - вывод
2.1. Какие основные классы используются для работы с потоками ввода - вывода
2.2. Основные правила во время работы с потоками ввода - вывода.
3. Сериализация

    Занятие 7
1. Многопоточность
1.1. Способы создания потоков
1.2. Виды состояния потоков
1.3. Ключевое слово volatile
1.4. Проблемы многопоточных дедлоки и лайфлоки
2. Пакет java.util.concurrent
2.1. Atomic
2.2. Lock
2.3. Executors
2.4. Future, CompletableFuture
2.5. Синхронизаторы

    Занятие 8
1. Сборщики проектов(Gradle, Maven)
1.1. Этапы сборки в Maven
1.2. Где на локальной машине хранятся скачанные зависимости
2. Git
push, pull, fetch
2 варианта слияния веток(merge, rebase)
cherry pick, squash patch, stash reset, revert

    Занятие 9
1. SOLID
2. Паттерны проектирования.

    Занятие 10
1. Web
1.1. Сетевая модель OSI(поверхностно)
1.2. Socket
1.3. Протокол НТТР
1.4. REST
2. Servlets, Apache Tomcat

     */